{
  "backend/main.mo": "Minimal Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report listing multiple frontend feature requirements and associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing many frontend source files and their roles in the app.",
  "frontend/DEVELOPMENT.md": "Developer guide covering prerequisites and setup flow for building and running the project.",
  "frontend/env.json": "Runtime config specifying the Internet Identity provider URL.",
  "frontend/index.css": "Global Tailwind-based styling defining color system, themes, and component visuals.",
  "frontend/index.html": "Base HTML document linking fonts and mounting the React app.",
  "frontend/README.md": "Project overview describing core features and linking to development instructions.",
  "frontend/src/App.tsx": "App root rendering the GoalsDashboard and global Toaster.",
  "frontend/src/components/CenteredNotification.tsx": "Centered pop‑up notification component with timed auto-dismiss.",
  "frontend/src/components/MonthlyCompletionCelebrationModal.tsx": "Large modal handling selfie capture, camera flow, image compositing, saving memories, and notifications.",
  "frontend/src/components/MonthlyMemoryShareActions.tsx": "Dropdown component providing social media sharing and download actions for monthly memory images.",
  "frontend/src/components/MonthlyProgressDonut.tsx": "Renders a circular SVG progress donut showing a percentage using OKLCH colors and smooth animation.",
  "frontend/src/components/MonthSelectionModal.tsx": "Dialog for selecting a month with confirm and cancel actions.",
  "frontend/src/components/YearlySummaryTable.tsx": "Builds a yearly goals summary table with per‑month stats, checkbox tracking, celebration modal triggers, and memory loading.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useCelebrationCamera.ts": "Wraps useCamera to manage video readiness, preview state, stream events, and safe photo capture with timeouts.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, stored identity loading, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder for backend query hooks; no logic implemented.",
  "frontend/src/index.css": "Defines Tailwind base styles, OKLCH color variables, dark mode tokens, and custom UI styling for summary tables.",
  "frontend/src/lib/celebrationImageComposite.ts": "Generates a Polaroid‑style composite selfie by loading images, drawing them on a canvas, and exporting a JPEG data URL.",
  "frontend/src/lib/monthlyMemoryShare.ts": "Provides utilities to share monthly memory images using Web Share API with fallbacks for download, social links, and clipboard copy.",
  "frontend/src/lib/monthlyMemoryStorage.ts": "Handles saving, retrieving, clearing, and listing month-tagged memory images in localStorage.",
  "frontend/src/lib/months.ts": "Exports the list of month names and a Month type derived from them.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider and renders App.",
  "frontend/src/pages/GoalsDashboard.tsx": "Renders predefined goal-category cards with goal CRUD, completion handling, and month assignment logic.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens, animations, and plugins for the project.",
  "frontend/tsconfig.node.json": "TypeScript config for node-side builds, enabling ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Defines Vite config with React plugin, env injection, path aliases, dev server proxy, and build output settings.",
  "project_state.json": "Describes the project’s features, versioned state, and summaries of implemented UI workflows and functionality."
}