{
  "backend/main.mo": "Empty Motoko canister with no logic.",
  "feature_evidence.json": "Feature evidence report mapping a modal save-to-memories feature to its source file and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files for reference or tooling.",
  "frontend/DEVELOPMENT.md": "Developer guide outlining prerequisites and steps for local development and deployment.",
  "frontend/env.json": "Runtime config defining the Internet Identity URL.",
  "frontend/index.css": "Tailwind base styles and extensive OKLCH theme variables plus UI styling.",
  "frontend/index.html": "Basic HTML shell loading fonts and mounting the React app.",
  "frontend/README.md": "Project overview describing features and linking to development instructions.",
  "frontend/src/App.tsx": "Root component rendering the dashboard and global toast system.",
  "frontend/src/components/CenteredNotification.tsx": "Auto‑dismiss centered notification component rendered above modals.",
  "frontend/src/components/MonthlyCompletionCelebrationModal.tsx": "Large celebration modal handling selfie capture, uploads, compositing, and memory saving.",
  "frontend/src/components/MonthlyMemoryShareActions.tsx": "Dropdown providing social and system sharing actions for a monthly memory image.",
  "frontend/src/components/MonthlyProgressDonut.tsx": "SVG donut visualization showing monthly progress as a circular meter.",
  "frontend/src/components/MonthSelectionModal.tsx": "Modal for choosing a month with confirm and cancel actions.",
  "frontend/src/components/YearlySummaryTable.tsx": "Renders a yearly summary table of completed goals with checkbox tracking, monthly stats, and celebration/memory modals. Manages localStorage state, monthly grouping, and UI interactions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity authentication and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useCelebrationCamera.ts": "Wraps useCamera to ensure video preview readiness and provides camera control, readiness checks, and photo capture for celebration selfies.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, identity loading, and state management using DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing because no backend queries are needed.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining color variables, theming, and component styles including enhanced checkbox and statistics table styling.",
  "frontend/src/lib/celebrationImageComposite.ts": "Generates a Polaroid-style composite image by combining a selfie with an overlay badge and provides helpers for image loading and file-to-dataURL conversion.",
  "frontend/src/lib/monthlyMemoryShare.ts": "Utilities for sharing monthly memory images via Web Share API, with fallbacks for downloading, sharing links, and copying text.",
  "frontend/src/lib/monthlyMemoryStorage.ts": "Handles saving, retrieving, and clearing monthly memory images in localStorage, including fetching all saved months.",
  "frontend/src/lib/months.ts": "Defines a constant list of month names and a corresponding Month type.",
  "frontend/src/lib/yearlySummaryCheckboxStorage.ts": "Manages loading, saving, and clearing yearly summary checkbox states in localStorage with validation.",
  "frontend/src/main.tsx": "App entry point that sets up React rendering with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/GoalsDashboard.tsx": "Implements a goals dashboard UI with categorized goal cards, goal management, and yearly summary integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, animations, and enabling plugins.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-side tooling, specifying module resolution and compiler options.",
  "frontend/vite.config.ts": "Vite config enabling React, environment variables, path aliases, a dev proxy, and build settings.",
  "project_state.json": "Project metadata describing existing features, new requests, versioning, and general project state."
}