{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report linking celebration modal requirements to MonthlyCompletionCelebrationModal.tsx.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing each frontend file’s purpose.",
  "frontend/DEVELOPMENT.md": "Developer guide explaining setup, local development, and deployment steps.",
  "frontend/env.json": "Runtime config defining the Internet Identity provider URL.",
  "frontend/index.css": "Global Tailwind and design token styles including theme variables and celebration modal styling.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app.",
  "frontend/README.md": "Project overview describing features and linking to development instructions.",
  "frontend/src/App.tsx": "Renders the GoalsDashboard page as the root component.",
  "frontend/src/components/CenteredNotification.tsx": "Centered auto‑dismissing notification component with fade‑in animation.",
  "frontend/src/components/MonthlyCompletionCelebrationModal.tsx": "Celebration modal showing confetti, headline, optional selfie upload, default image fallback, and badge overlay.",
  "frontend/src/components/MonthlyProgressDonut.tsx": "SVG donut chart showing monthly progress via circular stroke animation.",
  "frontend/src/components/MonthSelectionModal.tsx": "Modal for selecting a month using a grid of buttons with confirm and cancel actions.",
  "frontend/src/components/YearlySummaryTable.tsx": "Yearly summary table that calculates per‑month completion and triggers the celebration modal on 100% transitions.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current Internet Identity and refreshes related queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context for managing Internet Identity authentication, including login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file exporting nothing; no backend queries are used.",
  "frontend/src/index.css": "Defines Tailwind base, components, utilities, and extensive OKLCH theme variables for light/dark mode styling.",
  "frontend/src/lib/months.ts": "Exports a constant list of month names and a Month type.",
  "frontend/src/main.tsx": "Bootstraps the app with ReactDOM, wrapping App in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/GoalsDashboard.tsx": "Implements the main goals dashboard with predefined category cards, local state for goals, and UI for adding, editing, completing, and assigning months.",
  "frontend/tailwind.config.js": "Configures Tailwind with plugins, theme extensions, OKLCH color variables, and custom animations.",
  "frontend/tsconfig.node.json": "TypeScript config for Vite’s node-side files with ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Vite config enabling React, environment variables, path aliases, a dev proxy, and build settings.",
  "project_state.json": "Stores metadata describing the project’s features, versions, and capabilities for build planning."
}