{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report mapping a dashboard instructional‑text requirement to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their roles in the Goals Dashboard app.",
  "frontend/DEVELOPMENT.md": "Developer guide outlining prerequisites and steps for local development and deployment on the Internet Computer.",
  "frontend/env.json": "Contains runtime configuration values such as the Internet Identity URL.",
  "frontend/index.css": "Global Tailwind-based styling including theme variables, dark mode settings, and base element styling.",
  "frontend/index.html": "HTML entry file setting up font loading and mounting the React application root.",
  "frontend/README.md": "Project overview describing features of the Goals Dashboard and linking to development instructions.",
  "frontend/src/App.tsx": "React root component that renders the GoalsDashboard and initializes the Toaster.",
  "frontend/src/components/CenteredNotification.tsx": "Centered auto-dismissing notification component that displays a temporary message overlay.",
  "frontend/src/components/MonthlyCompletionCelebrationModal.tsx": "Large modal handling camera-based or uploaded photo celebrations, including capture flow, processing, and save notifications.",
  "frontend/src/components/MonthlyMemoryShareActions.tsx": "Dropdown menu offering sharing actions for monthly memory images across system share, download, and social platforms.",
  "frontend/src/components/MonthlyProgressDonut.tsx": "SVG donut component that visually displays monthly progress using a colored circular progress ring.",
  "frontend/src/components/MonthSelectionModal.tsx": "Modal for selecting a month with a grid of month buttons and confirm/cancel actions.",
  "frontend/src/components/YearlySummaryTable.tsx": "Renders a yearly goals summary table with monthly stats, celebration modals, memory uploads, and checkbox-based UI state tracking.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and invalidates related queries when the identity changes.",
  "frontend/src/hooks/useCelebrationCamera.ts": "Wraps useCamera to manage video readiness, stream events, and capture flow for celebration photos.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity login, persistence, status tracking, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting that no backend queries are needed.",
  "frontend/src/index.css": "Defines global Tailwind styles, theme variables, and custom component styles including summary table checkbox and layout rules.",
  "frontend/src/lib/celebrationImageComposite.ts": "Generates a Polaroid-style composite image by combining a selfie with an overlay badge and provides helpers for image loading and file-to-data-URL conversion.",
  "frontend/src/lib/monthlyMemoryShare.ts": "Provides utilities to share or download monthly memory images, including Web Share API usage and social share URL generators.",
  "frontend/src/lib/monthlyMemoryStorage.ts": "Handles saving, retrieving, clearing, and listing monthly memory images in localStorage.",
  "frontend/src/lib/months.ts": "Exports a constant list of month names and a Month type union.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/GoalsDashboard.tsx": "Implements the goals dashboard UI with predefined goal cards and interactions for managing goals.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS themes, colors, animations, and plugins for the project.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related files, enabling ESNext modules and composite builds.",
  "frontend/vite.config.ts": "Vite configuration for React, environment variables, path aliases, dev server proxy, and build settings.",
  "project_state.json": "Describes the project's state, features, and pending requests, including an instructional text addition feature."
}