{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report describing a UI change to make instructional text more prominent in GoalsDashboard.tsx.",
  "frontend-file-summaries.txt": "List of summarized frontend file purposes including updated prominent instructional text in GoalsDashboard.",
  "frontend/DEVELOPMENT.md": "Developer guide outlining prerequisites and steps for local development and deployment.",
  "frontend/env.json": "Environment configuration containing the Internet Identity URL.",
  "frontend/index.css": "Global Tailwind styles defining OKLCH color variables, dark mode values, and base styling.",
  "frontend/index.html": "HTML entry point loading the Lora font and mounting the React root.",
  "frontend/README.md": "Project overview describing features and quick start instructions for the Goals Dashboard app.",
  "frontend/src/App.tsx": "Main React app rendering the GoalsDashboard and global Toaster.",
  "frontend/src/components/CenteredNotification.tsx": "Centered auto‑dismissing notification component with configurable duration.",
  "frontend/src/components/MonthlyCompletionCelebrationModal.tsx": "Large modal handling selfie capture, uploads, memory saving, and celebration flows with camera controls.",
  "frontend/src/components/MonthlyMemoryShareActions.tsx": "Dropdown with sharing options for monthly memory images including system share, downloads, and social links.",
  "frontend/src/components/MonthlyProgressDonut.tsx": "SVG donut component showing monthly progress as a colored circular meter.",
  "frontend/src/components/MonthSelectionModal.tsx": "Modal for selecting a month using a grid and confirm/cancel actions.",
  "frontend/src/components/YearlySummaryTable.tsx": "Renders a yearly goals summary table with progress tracking, monthly memories, and celebration modal handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating queries when the identity changes.",
  "frontend/src/hooks/useCelebrationCamera.ts": "Wraps useCamera to ensure video readiness before captures, managing preview state, events, and cleanup.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and stored identity restoration logic.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder exporting nothing for this version’s local-only goal state.",
  "frontend/src/index.css": "Defines global Tailwind styles, theme variables, and custom components including styles for summary table checkboxes.",
  "frontend/src/lib/celebrationImageComposite.ts": "Builds a composited Polaroid-style selfie image with an overlay badge and includes utilities for loading images and converting files.",
  "frontend/src/lib/monthlyMemoryShare.ts": "Provides utilities to share monthly memory images via Web Share API with fallbacks for download, social links, and clipboard copy.",
  "frontend/src/lib/monthlyMemoryStorage.ts": "Handles saving, retrieving, clearing, and listing monthly memory images in localStorage.",
  "frontend/src/lib/months.ts": "Exports the list of month names and a Month type union.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/GoalsDashboard.tsx": "Renders the goals dashboard with categorized goal cards, editing, completion toggles, and month assignment features.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, colors, animations, and plugins.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-side tooling, including module and resolution settings.",
  "frontend/vite.config.ts": "Vite configuration enabling React, environment variables, path aliases, dev server proxy, and build settings.",
  "project_state.json": "Defines current project metadata, including features, requests, and state version."
}