{
  "backend/main.mo": "Minimal Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report linking a UI contrast update request to the YearlySummaryTable component.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files.",
  "frontend/DEVELOPMENT.md": "Development guide outlining prerequisites and local setup steps for the project.",
  "frontend/env.json": "Environment configuration providing the Internet Identity URL.",
  "frontend/index.css": "Global Tailwind-based styles defining color variables, themes, and base styling for the app.",
  "frontend/index.html": "HTML entry point that loads fonts and mounts the React application.",
  "frontend/README.md": "Project overview describing features of the Goals Dashboard app and linking to development docs.",
  "frontend/src/App.tsx": "Root React component rendering the GoalsDashboard and global Toaster.",
  "frontend/src/components/CenteredNotification.tsx": "Centered auto-dismissing notification component rendered above modals.",
  "frontend/src/components/MonthlyCompletionCelebrationModal.tsx": "Large modal handling camera-based or uploaded monthly memory images with capture, processing, and save logic.",
  "frontend/src/components/MonthlyMemoryShareActions.tsx": "Dropdown providing sharing and download actions for monthly memory images.",
  "frontend/src/components/MonthlyProgressDonut.tsx": "SVG donut indicator showing monthly progress as a circular chart.",
  "frontend/src/components/MonthSelectionModal.tsx": "Modal for selecting a single month with confirm and cancel actions.",
  "frontend/src/components/YearlySummaryTable.tsx": "Renders a yearly summary table of completed goals by month, manages checkbox UI state, celebration modals, and monthly memory data.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useCelebrationCamera.ts": "Enhances the base camera hook with preview readiness tracking, event listeners, and utilities for capture and camera switching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing because no backend queries are needed.",
  "frontend/src/index.css": "Defines global Tailwind layers, theme variables, component styles, and custom utilities including styling for summary table checkboxes.",
  "frontend/src/lib/celebrationImageComposite.ts": "Generates a composited celebration image by combining a selfie with a Polaroid frame and overlay badge, plus utilities for loading images and converting files.",
  "frontend/src/lib/monthlyMemoryShare.ts": "Provides utilities to share monthly memory images via Web Share API with fallbacks for downloading and social media links.",
  "frontend/src/lib/monthlyMemoryStorage.ts": "Handles saving, retrieving, and clearing monthly memory images in localStorage.",
  "frontend/src/lib/months.ts": "Defines the list of month names and a Month type.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/GoalsDashboard.tsx": "Implements a goals dashboard UI with categorized goal cards and month assignment features.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, animations, and plugins.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related build settings referencing vite config.",
  "frontend/vite.config.ts": "Vite configuration enabling React, environment variables, aliases, and API proxying.",
  "project_state.json": "Project metadata describing current features, issues, and pending requests."
}