{
  "backend/main.mo": "Defines an empty Motoko actor canister.",
  "feature_evidence.json": "Feature evidence report listing two frontend feature changes and their related files and components.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of all major frontend source files for reference.",
  "frontend/DEVELOPMENT.md": "Developer guide with prerequisites and setup instructions for building and deploying the app.",
  "frontend/env.json": "Runtime environment configuration containing the Internet Identity URL.",
  "frontend/index.css": "Global Tailwind and OKLCH-based styling including theme variables and layout rules.",
  "frontend/index.html": "HTML entry point loading fonts and bootstrapping the React app.",
  "frontend/README.md": "Project overview describing features and pointing to the development guide.",
  "frontend/src/App.tsx": "Main React app component that renders the GoalsDashboard page.",
  "frontend/src/components/CenteredNotification.tsx": "Auto‑dismissing centered notification component.",
  "frontend/src/components/MonthlyCompletionCelebrationModal.tsx": "Celebration modal with selfie upload and camera capture flow using useCelebrationCamera.",
  "frontend/src/components/MonthlyProgressDonut.tsx": "SVG donut chart showing monthly progress.",
  "frontend/src/components/MonthSelectionModal.tsx": "Modal for selecting a month with confirm and cancel actions.",
  "frontend/src/components/YearlySummaryTable.tsx": "Yearly summary table with monthly stats, checkbox tracking, and 100% completion celebration trigger.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, invalidating related queries when it updates.",
  "frontend/src/hooks/useCelebrationCamera.ts": "Wraps a camera hook to ensure video preview readiness, handling playback events, timeouts, and camera controls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state and actions using AuthClient, exposing identity, login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are required.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, utility classes, and custom component styling.",
  "frontend/src/lib/months.ts": "Exports a constant list of month names and a corresponding Month type.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/GoalsDashboard.tsx": "Implements a goal‑tracking dashboard with editable goal cards, monthly assignment, and summary table integration.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related build settings, including module resolution and composite builds.",
  "frontend/vite.config.ts": "Sets up Vite with React, env injection, path aliases, dev server proxying, and build output settings.",
  "project_state.json": "Defines project metadata plus a detailed description of the app’s features and a list of existing feature entries with IDs, titles, synonyms, descriptions, and versions. Serves as a structured record of implemented functionality and project state."
}