{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report linking a specific yearly-summary logic fix to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to human-written summaries of their roles in the app.",
  "frontend/DEVELOPMENT.md": "Developer guide with prerequisites and steps for local development and deployment on the Internet Computer.",
  "frontend/env.json": "Runtime environment config specifying the Internet Identity URL.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color tokens, theming, and base styles for light and dark modes.",
  "frontend/index.html": "HTML entry point loading fonts and bootstrapping the React application.",
  "frontend/README.md": "Project overview describing key features of the Goals Dashboard and linking to the development guide.",
  "frontend/src/App.tsx": "Renders the main GoalsDashboard view and initializes the global Toaster for notifications.",
  "frontend/src/components/CenteredNotification.tsx": "Timed, centered overlay alert component that auto-dismisses after a configurable duration.",
  "frontend/src/components/MonthlyCompletionCelebrationModal.tsx": "Complex modal handling monthly completion celebrations, camera capture flows, image processing, and save notifications.",
  "frontend/src/components/MonthlyMemoryShareActions.tsx": "Dropdown UI for sharing monthly memory images across social platforms with download and caption-copy helpers.",
  "frontend/src/components/MonthlyProgressDonut.tsx": "SVG donut component showing monthly progress as a circular percentage indicator.",
  "frontend/src/components/MonthSelectionModal.tsx": "Dialog-based month picker with a 12-month grid and confirm/cancel actions.",
  "frontend/src/components/YearlySummaryTable.tsx": "React component that displays a yearly goals summary table with checkbox tracking, monthly memories, and celebration modal logic.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's Internet Identity and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useCelebrationCamera.ts": "Hook wrapping useCamera to manage camera readiness, stream handling, preview state, and photo capture for celebration selfies.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login flow, and persisted identities.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are needed.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining color variables, themes, utilities, and component styles including summary table and statistics styling.",
  "frontend/src/lib/celebrationImageComposite.ts": "Utility for compositing a selfie with a Polaroid-style frame and overlay badge, plus helpers for loading images and converting files to data URLs.",
  "frontend/src/lib/monthlyMemoryShare.ts": "Provides helpers to share monthly memory images via Web Share API with fallbacks for download, social links, and clipboard copy.",
  "frontend/src/lib/monthlyMemoryStorage.ts": "Handles saving, retrieving, clearing, and listing month-tagged image data URLs in localStorage.",
  "frontend/src/lib/months.ts": "Defines the list of months and a Month type based on that list.",
  "frontend/src/lib/yearlySummaryCheckboxStorage.ts": "Stores, loads, validates, and clears yearly summary checkbox state using localStorage.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider setup.",
  "frontend/src/pages/GoalsDashboard.tsx": "Defines the goals dashboard page with goal categories, UI interactions, and monthly assignment features.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, plugins, and global design tokens.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-side tooling with ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Vite config setting React plugin, env, alias paths, dev server proxy, and build output.",
  "project_state.json": "Metadata describing project state, features, issues, and the goal to fix an unwanted congrats modal behavior."
}