{
  "kind": "build_request",
  "title": "Increase visibility of dashboard instructional text",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the Goals Dashboard \"dashboard\" view, make the instructional text \"Organize your life: pick a goal (or add a new one) and assign it to the month you want to start crushing it!\" significantly more visible while keeping the text content exactly the same. Update its styling in frontend/src/pages/GoalsDashboard.tsx (currently rendered as a <p> with classes \"text-sm text-muted-foreground mb-4 font-lora-italic\") by increasing visual prominence (e.g., larger font size, stronger contrast color, and/or emphasis such as font weight or a subtle background container) so it stands out above the goal cards in both light and dark mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Make the text : \"Organize your life: pick a goal (or add a new one) and assign it to the month you want to start crushing it!\" more visible"
        ]
      },
      "acceptanceCriteria": [
        "The instructional text string remains exactly: \"Organize your life: pick a goal (or add a new one) and assign it to the month you want to start crushing it!\" (no copy changes).",
        "On the dashboard view, the instructional text is visually more prominent than before (at minimum: increased contrast vs. current text-muted-foreground and/or increased font size).",
        "The instructional text remains readable and appropriately contrasted in both light mode and dark mode.",
        "Layout remains stable: the text still appears above the horizontally scrollable goal cards and does not overlap other UI elements."
      ]
    }
  ],
  "constraints": [
    "Frontend paths listed as immutable must not be edited (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*).",
    "Do not introduce new backend canisters or services; this change should be frontend-only."
  ],
  "nonGoals": [
    "Changing the instructional text wording.",
    "Adding new goal-management features or changing goal card behavior.",
    "Backend changes or data migration."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}