{
  "kind": "build_request",
  "title": "Prevent congrats (celebration) modal from reopening when returning to Yearly Summary",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Yearly Summary completion-transition logic so the MonthlyCompletionCelebrationModal (congrats modal) does not auto-open when navigating from Yearly Summary to Dashboard via the \"Back to dashboard\" button and then reopening Yearly Summary via \"View yearly summary\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "After pressing the Back to the dashboard\" button and press \"View yearly summary\"  is appearing the congrats modal. Fix it."
        ]
      },
      "acceptanceCriteria": [
        "Given at least one month is already 100% complete in the saved Yearly Summary checkbox state, when the user opens Yearly Summary, clicks \"Back to dashboard\", and then clicks \"View yearly summary\" again, the MonthlyCompletionCelebrationModal must not automatically open.",
        "The MonthlyCompletionCelebrationModal must still open when (and only when) a month transitions from not-complete to 100% complete due to the user checking the final remaining checkbox for that month during the current session.",
        "The fix must be implemented in or via the current completion-transition detection in frontend/src/components/YearlySummaryTable.tsx without breaking existing monthly memory thumbnail/placeholder behavior."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose only).",
    "Backend is single-actor Motoko; no backend changes are required for this UI-state bug."
  ],
  "nonGoals": [
    "Do not redesign the Yearly Summary table UI.",
    "Do not change how checkbox state is persisted (localStorage key, schema, or storage utility behavior) unless required to prevent the unwanted modal opening.",
    "Do not add new authentication, routing, or backend persistence for this fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}