{
  "kind": "build_request",
  "title": "Set uploaded selfieGirl image as default celebration modal photo in Time-Bound targets - 2026",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "In the “Time-Bound targets - 2026” 100% completion congrats modal (MonthlyCompletionCelebrationModal), change the default (when no user photo is selected) image shown in the media area below the text “Want to celebrate with a selfie?” to the user-provided uploaded image (selfieGirl.jpg), served as a static asset from the frontend.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In the view Time-Bound targets - 2026 , inside the congrats modal, add this exact picture by default bellow the text : want to celebrate with a selfie?"
        ]
      },
      "acceptanceCriteria": [
        "When the congrats modal opens and the user has not captured/uploaded an image, the displayed preview image matches the provided selfieGirl.jpg content (not the previous default image).",
        "After the user captures or uploads a photo, that selected photo replaces the default image as it does today.",
        "The default image is loaded from a static frontend path (not via the backend)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add the new default image file to the static assets folder at frontend/public/assets/generated and update the default-image reference in frontend/src/components/MonthlyCompletionCelebrationModal.tsx to use this new filename.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "The project contains the new default image under frontend/public/assets/generated with the exact filename specified in imageRequirements.required.",
        "DEFAULT_CELEBRATION_IMAGE in MonthlyCompletionCelebrationModal.tsx points to the new asset path and renders correctly in the modal."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not modify any files listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "No changes to the selfie capture flow, countdown, upload flow, or camera permissions/error handling.",
    "No backend changes or persistence changes."
  ],
  "imageRequirements": {
    "required": [
      "Portrait selfie photo of a smiling woman with soft sparkle/bokeh overlay and large beige outlined text reading “I crushed my monthly goals!” near the bottom (celebration-default-selfieGirl.dim_696x609.png)"
    ],
    "edits": []
  }
}