{
  "kind": "build_request",
  "title": "Match 100% completion celebration modal UI/message to provided reference in Time-Bound targets - 2026",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "In the “Time-Bound targets - 2026” (Yearly Summary Table) view, ensure the 100% completion celebration modal visually and textually matches the provided reference screenshots (image-6.png, image-7.png), including the same headline style, emoji usage, and message copy.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "In the view Time-Bound targets - 2026, If a month reaches 100% completion, display a Modal with the same message and image like in the picture."
        ]
      },
      "acceptanceCriteria": [
        "When a month transitions to 100% completion, the modal appears and the headline and body text match the reference screenshots (including punctuation/ellipsis and emojis).",
        "The modal retains a close (X) control in the top-right and can be dismissed via the X and the secondary action without breaking the summary table interaction."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Update the celebration modal media area so that, when no user selfie has been selected yet, it displays a built-in default celebration image matching the reference screenshot’s layout (instead of an empty placeholder area). Keep the existing behavior to show the user-selected selfie once provided.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "display a Modal with the same message and image like in the picture."
        ]
      },
      "acceptanceCriteria": [
        "Opening the modal without selecting a selfie shows the default celebration image.",
        "After selecting a selfie, the modal shows the selected selfie preview (replacing the default image).",
        "Closing and reopening the modal resets back to the default celebration image (until a new selfie is selected)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Add the new default celebration image as a static asset under `frontend/public/assets/generated/` and reference it directly from the modal component (do not route images through the backend).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "display a Modal with the same message and image like in the picture."
        ]
      },
      "acceptanceCriteria": [
        "The default celebration image is present in `frontend/public/assets/generated/` and loads correctly in the modal in dev and production builds."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` (compose existing UI components instead).",
    "Do not change backend canister logic; this modal behavior remains client-only.",
    "Keep the existing trigger logic: the modal opens only when a month transitions to 100% completion and the month has at least one goal."
  ],
  "nonGoals": [
    "Adding backend persistence for the Yearly Summary checkbox state.",
    "Implementing actual sharing to social media or external services."
  ],
  "imageRequirements": {
    "required": [
      "Photo-like celebratory portrait image for modal default state (celebration-default-photo.dim_900x700.png)"
    ],
    "edits": []
  }
}