{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Use uploaded selfieGirl asset as default celebration modal image (Time-Bound targets - 2026)",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Update the MonthlyCompletionCelebrationModal default (no user photo selected) media preview to use the provided selfieGirl image served from a static frontend asset path.",
      "acceptanceCriteria": [
        "When the congrats modal opens and the user has not captured/uploaded an image, the displayed preview image matches the provided selfieGirl.jpg content (not the previous default image).",
        "After the user captures or uploads a photo, that selected photo replaces the default image as it does today.",
        "The default image is loaded from a static frontend path (not via the backend)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MonthlyCompletionCelebrationModal.tsx",
          "operation": "modify",
          "description": "Change the default image constant used when selectedImage is null so the media preview renders the new static asset (frontend/public/assets/generated/celebration-default-selfieGirl.dim_696x609.png) in the “Want to celebrate with a selfie?” area, while preserving existing behavior where captured/uploaded images override the default."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add the required generated default image to static assets and point DEFAULT_CELEBRATION_IMAGE to the new filename.",
      "acceptanceCriteria": [
        "The project contains the new default image under frontend/public/assets/generated with the exact filename specified in imageRequirements.required.",
        "DEFAULT_CELEBRATION_IMAGE in MonthlyCompletionCelebrationModal.tsx points to the new asset path and renders correctly in the modal."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/celebration-default-selfieGirl.dim_696x609.png",
          "operation": "create",
          "description": "Add the new required default celebration image asset at the exact static path frontend/public/assets/generated/celebration-default-selfieGirl.dim_696x609.png."
        },
        {
          "path": "frontend/src/components/MonthlyCompletionCelebrationModal.tsx",
          "operation": "modify",
          "description": "Update DEFAULT_CELEBRATION_IMAGE to reference /assets/generated/celebration-default-selfieGirl.dim_696x609.png so the modal renders the new default image correctly when no user photo is selected."
        }
      ]
    }
  ]
}