{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Close Congrats modal on save and show 3-second notification",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Close the MonthlyCompletionCelebrationModal immediately on “Save to Memories” click and show a global 3-second confirmation notification while keeping existing save + monthly memories refresh behavior.",
      "acceptanceCriteria": [
        "Clicking \"Save to Memories\" closes the Congrats modal immediately (no waiting for a notification to finish).",
        "A pop-up notification appears after the click and auto-dismisses after ~3000ms.",
        "The pop-up notification is visible even though the modal is closed (i.e., it is not rendered inside the modal content).",
        "The memory is still saved successfully and the monthly memories UI refreshes as it does today."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MonthlyCompletionCelebrationModal.tsx",
          "operation": "modify",
          "description": "Update the “Save to Memories” click handler to (1) save the memory and trigger the existing parent refresh callback as it does today, (2) immediately close the dialog via onOpenChange(false), and (3) show a global confirmation notification for ~3000ms using the existing shadcn-ui Sonner Toaster already mounted at the app root (import and call toast from Sonner with a 3000ms duration). Remove/stop using the in-modal CenteredNotification state/logic so the notification is not rendered within the modal. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Confirm the global Toaster remains mounted alongside the main app content so notifications triggered from MonthlyCompletionCelebrationModal render outside of the modal tree. (No behavioral change expected; only adjust if required.) Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}